## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_firewall.infrastructure01-firewall will be created
  + resource "digitalocean_firewall" "infrastructure01-firewall" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + name            = "infrastructure01.akatsuki.gg-access"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "8200"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
            # (1 unchanged attribute hidden)
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

  # digitalocean_firewall.mysql-master01-firewall will be created
  + resource "digitalocean_firewall" "mysql-master01-firewall" {
      + created_at      = (known after apply)
      + droplet_ids     = [
          + 383025155,
        ]
      + id              = (known after apply)
      + name            = "mysql-master01.akatsuki.gg-access"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "3306"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = [
              + "k8s-production",
            ]
        }
      + inbound_rule {
          + port_range                = "443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "103.21.244.0/22",
              + "103.22.200.0/22",
              + "103.31.4.0/22",
              + "104.16.0.0/13",
              + "104.24.0.0/14",
              + "108.162.192.0/18",
              + "131.0.72.0/22",
              + "141.101.64.0/18",
              + "162.158.0.0/15",
              + "172.64.0.0/13",
              + "173.245.48.0/20",
              + "188.114.96.0/20",
              + "190.93.240.0/20",
              + "197.234.240.0/22",
              + "198.41.128.0/17",
              + "2400:cb00::/32",
              + "2405:8100::/32",
              + "2405:b500::/32",
              + "2606:4700::/32",
              + "2803:f800::/32",
              + "2a06:98c0::/29",
              + "2c0f:f248::/32",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "5432"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = [
              + "k8s-production",
            ]
        }
      + inbound_rule {
          + port_range                = "5672"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = [
              + "k8s-production",
            ]
        }
      + inbound_rule {
          + port_range                = "6379"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = [
              + "k8s-production",
            ]
        }
      + inbound_rule {
          + port_range                = "80"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
            # (1 unchanged attribute hidden)
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>